Repository: xcv58/MacTools
Catalog: Sources/Resources/Localization/Plugins.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# plugin.empty.openInstalled
source: 打开已安装插件
ar: افتح المكونات الإضافية المثبتة
de: Installierte Plugins öffnen
en: Open installed plugins
es: Abrir complementos instalados
fr: Ouvrir les plugins installés
ja: インストールされているプラグインを開く
ko: 설치된 플러그인 열기
pt: Abrir plug-ins instalados
ru: Открыть установленные плагины
tr: Yüklü eklentileri aç
zh_hant: 打開已安裝外掛

# plugin.empty.openMarketplace
source: 打开插件市场
ar: افتح سوق المكونات الإضافية
de: Plugin-Marktplatz öffnen
en: Open plugin marketplace
es: Mercado de complementos abierto
fr: Ouvrir le marché des plugins
ja: プラグイン マーケットプレイスを開く
ko: 플러그인 마켓플레이스 열기
pt: Abrir mercado de plug-ins
ru: Открытый магазин плагинов
tr: Eklenti pazar yerini aç
zh_hant: 打開外掛市場

# plugin.empty.or
source: 或
ar: أو
de: oder
en: or
es: o
fr: ou
ja: または
ko: 또는
pt: ou
ru: или
tr: veya

# plugin.empty.pluginSuffix
source: 插件
ar: المكونات الإضافية
de: Plugins
en: plugins
es: complementos
fr: plugins
ja: プラグイン
ko: 플러그인
pt: plug-ins
ru: плагины
tr: eklenti
zh_hant: 外掛

# plugin.error.catalog.bulkUpdateFailedFormat
source: 部分插件更新失败：%@
ar: فشلت بعض تحديثات المكونات الإضافية: %@
de: Einige Plugin-Updates sind fehlgeschlagen: %@
en: Some plugin updates failed: %@
es: Algunas actualizaciones de complementos fallaron: %@
fr: Certaines mises à jour du plug-in ont échoué : %@
ja: 一部のプラグインの更新に失敗しました: %@
ko: 일부 플러그인 업데이트 실패: %@
pt: Algumas atualizações de plug-in falharam: %@
ru: Не удалось обновить некоторые плагины: %@
tr: Bazı eklenti güncellemeleri başarısız oldu: %@
zh_hant: 部分外掛更新失敗：%@

# plugin.error.catalog.duplicatePluginIDFormat
source: 插件列表包含重复插件：%@
ar: تحتوي قائمة المكونات الإضافية على مكون إضافي مكرر: %@
de: Plugin-Liste enthält ein doppeltes Plugin: %@
en: Plugin list contains a duplicate plugin: %@
es: La lista de complementos contiene un complemento duplicado: %@
fr: La liste des plugins contient un plugin en double : %@
ja: プラグイン リストに重複したプラグインが含まれています: %@
ko: 플러그인 목록에 중복된 플러그인이 포함되어 있습니다: %@
pt: A lista de plug-ins contém um plug-in duplicado: %@
ru: Список плагинов содержит дубликат плагина: %@
tr: Eklenti listesi yinelenen bir eklenti içeriyor: %@
zh_hant: 外掛列表包含重複外掛：%@

# plugin.error.catalog.entryNotFoundFormat
source: 插件列表中未找到插件：%@
ar: لم يتم العثور على المكون الإضافي في كتالوج المكونات الإضافية: %@
de: Plugin nicht im Plugin-Katalog gefunden: %@
en: Plugin not found in the plugin catalog: %@
es: Complemento no encontrado en el catálogo de complementos: %@
fr: Plugin introuvable dans le catalogue de plugins : %@
ja: プラグイン カタログにプラグインが見つかりません: %@
ko: 플러그인 카탈로그에서 플러그인을 찾을 수 없습니다: %@
pt: Plugin não encontrado no catálogo de plugins: %@
ru: Плагин не найден в каталоге плагинов: %@
tr: Eklenti, eklenti kataloğunda bulunamadı: %@
zh_hant: 外掛列表中未找到外掛：%@

# plugin.error.catalog.extractionRollbackFailedFormat
source: 插件功能迁移 %@ 失败：%@；回滚也失败：%@
ar: فشل ترحيل ميزة المكون الإضافي %@‏: %@؛ وفشل التراجع أيضًا: %@
de: Migration der Plugin-Funktion %@ fehlgeschlagen: %@; auch das Rollback ist fehlgeschlagen: %@
en: Plugin feature migration %@ failed: %@; rollback also failed: %@
es: Error en la migración de la función del complemento %@: %@; la reversión también falló: %@
fr: Échec de la migration de fonctionnalité du plugin %@ : %@ ; la restauration a également échoué : %@
ja: プラグイン機能の移行 %@ に失敗しました: %@。ロールバックにも失敗しました: %@
ko: 플러그인 기능 마이그레이션 %@ 실패: %@. 롤백도 실패함: %@
pt: Falha na migração do recurso do plug-in %@: %@; a reversão também falhou: %@
ru: Сбой миграции функции плагина %@: %@; откат также не выполнен: %@
tr: Eklenti özellik geçişi %@ başarısız oldu: %@; geri alma da başarısız oldu: %@
zh_hant: 外掛功能遷移 %@ 失敗：%@；回復也失敗：%@

# plugin.error.catalog.migrationCompletionPersistenceFailed
source: 插件已更新，但无法保存迁移完成状态；下次启动时将继续恢复。
ar: تم تحديث المكونات الإضافية، ولكن تعذر حفظ حالة اكتمال الترحيل. ستستمر الاستعادة عند التشغيل التالي.
de: Die Plugins wurden aktualisiert, aber der abgeschlossene Migrationsstatus konnte nicht gespeichert werden. Die Wiederherstellung wird beim nächsten Start fortgesetzt.
en: The plugins were updated, but the completed migration state could not be saved. Recovery will continue at the next launch.
es: Los complementos se actualizaron, pero no se pudo guardar el estado de migración completada. La recuperación continuará en el próximo inicio.
fr: Les plugins ont été mis à jour, mais l’état de migration terminée n’a pas pu être enregistré. La récupération se poursuivra au prochain lancement.
ja: プラグインは更新されましたが、移行完了状態を保存できませんでした。次回起動時に復旧を続行します。
ko: 플러그인은 업데이트되었지만 마이그레이션 완료 상태를 저장할 수 없습니다. 다음 실행 시 복구를 계속합니다.
pt: Os plug-ins foram atualizados, mas não foi possível salvar o estado de migração concluída. A recuperação continuará na próxima inicialização.
ru: Плагины обновлены, но не удалось сохранить состояние завершённой миграции. Восстановление продолжится при следующем запуске.
tr: Eklentiler güncellendi, ancak tamamlanan geçiş durumu kaydedilemedi. Kurtarma işlemi bir sonraki açılışta devam edecek.
zh_hant: 外掛已更新，但無法儲存遷移完成狀態；下次啟動時將繼續復原。

# plugin.error.catalog.migrationPlanInvalidated
source: 插件状态已更改，请重试更新。
ar: تغيرت حالة المكونات الإضافية. حاول التحديث مرة أخرى.
de: Der Pluginstatus hat sich geändert. Versuche die Aktualisierung erneut.
en: Plugin state changed. Try the update again.
es: El estado de los complementos cambió. Intenta actualizar de nuevo.
fr: L’état des plugins a changé. Réessayez la mise à jour.
ja: プラグインの状態が変更されました。もう一度アップデートしてください。
ko: 플러그인 상태가 변경되었습니다. 업데이트를 다시 시도하십시오.
pt: O estado dos plug-ins mudou. Tente atualizar novamente.
ru: Состояние плагинов изменилось. Повторите обновление.
tr: Eklenti durumu değişti. Güncellemeyi yeniden deneyin.
zh_hant: 外掛狀態已變更，請重試更新。

# plugin.error.catalog.migrationJournalPersistenceFailed
source: 无法保存插件迁移状态，已停止更新。
ar: تعذر حفظ حالة ترحيل المكون الإضافي. تم إيقاف التحديث.
de: Der Plugin-Migrationsstatus konnte nicht gespeichert werden. Die Aktualisierung wurde abgebrochen.
en: Could not save plugin migration state. The update was stopped.
es: No se pudo guardar el estado de migración del complemento. Se detuvo la actualización.
fr: Impossible d’enregistrer l’état de migration du plugin. La mise à jour a été interrompue.
ja: プラグインの移行状態を保存できなかったため、更新を中止しました。
ko: 플러그인 마이그레이션 상태를 저장할 수 없어 업데이트를 중단했습니다.
pt: Não foi possível salvar o estado de migração do plug-in. A atualização foi interrompida.
ru: Не удалось сохранить состояние миграции плагина. Обновление остановлено.
tr: Eklenti geçiş durumu kaydedilemedi. Güncelleme durduruldu.
zh_hant: 無法儲存外掛遷移狀態，已停止更新。

# plugin.error.catalog.httpStatusFormat
source: 插件列表读取失败：HTTP %d
ar: فشلت قراءة قائمة المكونات الإضافية: HTTP %d
de: Plugin-Liste konnte nicht gelesen werden: HTTP %d
en: Plugin list read failed: HTTP %d
es: Error de lectura de la lista de complementos: HTTP %d
fr: Échec de la lecture de la liste des plugins : HTTP %d
ja: プラグイン リストの読み取りに失敗しました: HTTP %d
ko: 플러그인 목록 읽기 실패: HTTP %d
pt: Falha na leitura da lista de plug-ins: HTTP %d
ru: Ошибка чтения списка плагинов: HTTP %d
tr: Eklenti listesi okunamadı: HTTP %d
zh_hant: 外掛列表讀取失敗：HTTP %d

# plugin.error.catalog.incompatibleHostFormat
source: 插件列表需要 MacTools %@ 或更高版本，当前版本为 %@。
ar: يتطلب كتالوج المكونات الإضافية MacTools %@ أو إصدارًا أحدث. الإصدار الحالي: %@.
de: Der Plugin-Katalog erfordert MacTools %@ oder höher. Aktuelle Version: %@.
en: The plugin catalog requires MacTools %@ or later. Current version: %@.
es: El catálogo de complementos requiere MacTools %@ o posterior. Versión actual: %@.
fr: Le catalogue de plugins nécessite MacTools %@ ou version ultérieure. Version actuelle : %@.
ja: プラグイン カタログには MacTools %@ 以降が必要です。現在のバージョン: %@。
ko: 플러그인 카탈로그에는 MacTools %@ 이상이 필요합니다. 현재 버전: %@.
pt: O catálogo de plug-ins requer MacTools %@ ou posterior. Versão atual: %@.
ru: Для каталога плагинов требуется MacTools %@ или более поздняя версия. Текущая версия: %@.
tr: Eklenti kataloğu MacTools %@ veya üzerini gerektiriyor. Geçerli sürüm: %@.
zh_hant: 外掛列表需要 MacTools %@ 或更高版本，當前版本為 %@。

# plugin.error.catalog.invalidChecksumFormat
source: 插件包校验值不合法：%@
ar: المجموع الاختباري لحزمة البرنامج الإضافي غير صالح: %@
de: Ungültige Prüfsumme des Plugin-Pakets: %@
en: Invalid plugin package checksum: %@
es: Suma de comprobación del paquete de complemento no válida: %@
fr: Somme de contrôle du package de plug-in invalide : %@
ja: 無効なプラグイン パッケージのチェックサム: %@
ko: 잘못된 플러그인 패키지 체크섬: %@
pt: Soma de verificação do pacote de plug-in inválida: %@
ru: Неверная контрольная сумма пакета плагина: %@
tr: Geçersiz eklenti paketi sağlama toplamı: %@
zh_hant: 外掛包校驗值不合法：%@

# plugin.error.catalog.invalidID
source: 插件列表 ID 不合法。
ar: معرف كتالوج البرنامج المساعد غير صالح.
de: Die Plugin-Katalog-ID ist ungültig.
en: The plugin catalog ID is invalid.
es: El ID del catálogo de complementos no es válido.
fr: L'ID du catalogue de plugins n'est pas valide.
ja: プラグイン カタログ ID が無効です。
ko: 플러그인 카탈로그 ID가 유효하지 않습니다.
pt: O ID do catálogo do plug-in é inválido.
ru: Идентификатор каталога плагинов недействителен.
tr: Eklenti kataloğu kimliği geçersiz.
zh_hant: 外掛列表 ID 不合法。

# plugin.error.catalog.invalidPackageSizeFormat
source: 插件包大小不合法：%@
ar: حجم حزمة البرنامج الإضافي غير صالح: %@
de: Ungültige Plugin-Paketgröße: %@
en: Invalid plugin package size: %@
es: Tamaño de paquete de complemento no válido: %@
fr: Taille du package de plug-in non valide : %@
ja: 無効なプラグイン パッケージ サイズ: %@
ko: 잘못된 플러그인 패키지 크기: %@
pt: Tamanho do pacote de plug-in inválido: %@
ru: Неверный размер пакета плагина: %@
tr: Geçersiz eklenti paketi boyutu: %@
zh_hant: 外掛包大小不合法：%@

# plugin.error.catalog.invalidPackageURLFormat
source: 插件包地址不支持：%@
ar: حزمة المكونات الإضافية غير المدعومة URL: %@
de: Nicht unterstütztes Plugin-Paket URL: %@
en: Unsupported plugin package URL: %@
es: Paquete de complementos no compatible URL: %@
fr: Package de plug-in non pris en charge URL : %@
ja: サポートされていないプラグイン パッケージ URL: %@
ko: 지원되지 않는 플러그인 패키지 URL: %@
pt: Pacote de plug-in não compatível URL: %@
ru: Неподдерживаемый пакет плагинов URL: %@
tr: Desteklenmeyen eklenti paketi URL'si: %@
zh_hant: 外掛包地址不支持：%@

# plugin.error.catalog.invalidSignature
source: 插件列表签名不匹配。
ar: توقيع كتالوج البرنامج المساعد غير متطابق.
de: Die Signatur des Plugin-Katalogs stimmt nicht überein.
en: The plugin catalog signature does not match.
es: La firma del catálogo de complementos no coincide.
fr: La signature du catalogue de plugins ne correspond pas.
ja: プラグイン カタログの署名が一致しません。
ko: 플러그인 카탈로그 서명이 일치하지 않습니다.
pt: A assinatura do catálogo do plugin não corresponde.
ru: Подпись каталога плагинов не совпадает.
tr: Eklenti kataloğu imzası eşleşmiyor.
zh_hant: 外掛列表簽名不匹配。

# plugin.error.catalog.localMustUseFileURLFormat
source: 本地插件列表必须使用 file URL：%@
ar: يجب أن يستخدم كتالوج المكونات الإضافية المحلي ملفًا URL: %@
de: Der lokale Plugin-Katalog muss eine Datei URL: %@ verwenden
en: Local plugin catalog must use a file URL: %@
es: El catálogo de complementos local debe utilizar un archivo URL: %@
fr: Le catalogue de plugins local doit utiliser un fichier URL : %@
ja: ローカル プラグイン カタログはファイル URL: %@ を使用する必要があります
ko: 로컬 플러그인 카탈로그는 URL: %@ 파일을 사용해야 합니다.
pt: O catálogo de plug-ins local deve usar um arquivo URL: %@
ru: Локальный каталог плагинов должен использовать файл URL: %@
tr: Yerel eklenti kataloğu bir dosya URL'si kullanmalı: %@
zh_hant: 本地外掛列表必須使用 file URL：%@

# plugin.error.catalog.missingPublicKey
source: 插件列表缺少内置公钥。
ar: يفتقد كتالوج المكونات الإضافية مفتاحًا عامًا مجمعًا.
de: Im Plugin-Katalog fehlt ein gebündelter öffentlicher Schlüssel.
en: The plugin catalog is missing a bundled public key.
es: Al catálogo de complementos le falta una clave pública incluida.
fr: Il manque une clé publique groupée dans le catalogue de plugins.
ja: プラグイン カタログにバンドルされた公開キーがありません。
ko: 플러그인 카탈로그에 번들 공개 키가 없습니다.
pt: O catálogo de plug-ins não possui uma chave pública agrupada.
ru: В каталоге плагинов отсутствует связанный открытый ключ.
tr: Eklenti kataloğunda paketle gelen genel anahtar eksik.
zh_hant: 外掛列表缺少內置公鑰。

# plugin.error.catalog.missingSignature
source: 正式插件列表缺少签名。
ar: يفتقد كتالوج المكونات الإضافية للإنتاج التوقيع.
de: Dem Produktions-Plugin-Katalog fehlt eine Signatur.
en: The production plugin catalog is missing a signature.
es: Al catálogo de complementos de producción le falta una firma.
fr: Il manque une signature dans le catalogue des plugins de production.
ja: 実稼働プラグイン カタログに署名がありません。
ko: 프로덕션 플러그인 카탈로그에 서명이 없습니다.
pt: Não há assinatura no catálogo de plug-ins de produção.
ru: В каталоге рабочих плагинов отсутствует подпись.
tr: Üretim eklenti kataloğunda imza eksik.
zh_hant: 正式外掛列表缺少簽名。

# plugin.error.catalog.revokedPluginFormat
source: 插件已被撤回：%@
ar: تم إبطال المكون الإضافي: %@
de: Plugin wurde widerrufen: %@
en: Plugin has been revoked: %@
es: El complemento ha sido revocado: %@
fr: Le plugin a été révoqué : %@
ja: プラグインは取り消されました: %@
ko: 플러그인이 취소되었습니다: %@
pt: O plug-in foi revogado: %@
ru: Плагин отозван: %@
tr: Eklenti geri çekildi: %@
zh_hant: 外掛已被撤回：%@

# plugin.error.catalog.signatureVerificationUnavailable
source: 插件列表签名无法校验。
ar: تعذر التحقق من توقيع كتالوج المكون الإضافي.
de: Die Signatur des Plugin-Katalogs konnte nicht überprüft werden.
en: The plugin catalog signature could not be verified.
es: No se pudo verificar la firma del catálogo de complementos.
fr: La signature du catalogue de plugins n'a pas pu être vérifiée.
ja: プラグイン カタログの署名を検証できませんでした。
ko: 플러그인 카탈로그 서명을 확인할 수 없습니다.
pt: Não foi possível verificar a assinatura do catálogo do plug-in.
ru: Не удалось проверить подпись каталога плагинов.
tr: Eklenti kataloğu imzası doğrulanamadı.
zh_hant: 外掛列表簽名無法校驗。

# plugin.error.catalog.unsupportedSDKFormat
source: 插件列表 SDK 版本不支持：%d
ar: إصدار SDK لكتالوج المكونات الإضافية غير المدعوم: %d
de: Nicht unterstützte Plugin-Katalog-SDK-Version: %d
en: Unsupported plugin catalog SDK version: %d
es: Versión del SDK del catálogo de complementos no compatible: %d
fr: Version du SDK du catalogue de plugins non prise en charge : %d
ja: サポートされていないプラグイン カタログ SDK バージョン: %d
ko: 지원되지 않는 플러그인 카탈로그 SDK 버전: %d
pt: Versão do SDK do catálogo de plug-ins não compatível: %d
ru: Неподдерживаемая версия SDK каталога плагинов: %d
tr: Desteklenmeyen eklenti kataloğu SDK sürümü: %d
zh_hant: 外掛列表 SDK 版本不支持：%d

# plugin.error.catalog.unsupportedSchemaFormat
source: 插件列表版本不支持：%d
ar: إصدار كتالوج المكونات الإضافية غير مدعوم: %d
de: Nicht unterstützte Plugin-Katalogversion: %d
en: Unsupported plugin catalog version: %d
es: Versión del catálogo de complementos no compatible: %d
fr: Version du catalogue de plugins non prise en charge : %d
ja: サポートされていないプラグイン カタログのバージョン: %d
ko: 지원되지 않는 플러그인 카탈로그 버전: %d
pt: Versão do catálogo de plug-ins não compatível: %d
ru: Неподдерживаемая версия каталога плагинов: %d
tr: Desteklenmeyen eklenti kataloğu sürümü: %d
zh_hant: 外掛列表版本不支持：%d

# plugin.error.catalog.unsupportedSignatureAlgorithmFormat
source: 插件列表签名算法不支持：%@
ar: خوارزمية توقيع كتالوج المكونات الإضافية غير مدعومة: %@
de: Nicht unterstützter Plugin-Katalog-Signaturalgorithmus: %@
en: Unsupported plugin catalog signature algorithm: %@
es: Algoritmo de firma del catálogo de complementos no compatible: %@
fr: Algorithme de signature du catalogue de plugins non pris en charge : %@
ja: サポートされていないプラグイン カタログ署名アルゴリズム: %@
ko: 지원되지 않는 플러그인 카탈로그 서명 알고리즘: %@
pt: Algoritmo de assinatura de catálogo de plug-ins não compatível: %@
ru: Неподдерживаемый алгоритм подписи каталога плагинов: %@
tr: Desteklenmeyen eklenti kataloğu imza algoritması: %@
zh_hant: 外掛列表簽名算法不支持：%@

# plugin.error.invocation.missingReturnValue
source: 插件调用未返回结果。
ar: لم يُرجع استدعاء المكون الإضافي نتيجة.
de: Der Plugin-Aufruf hat kein Ergebnis zurückgegeben.
en: The plugin call did not return a result.
es: La llamada del complemento no arrojó ningún resultado.
fr: L'appel du plugin n'a renvoyé aucun résultat.
ja: プラグイン呼び出しは結果を返しませんでした。
ko: 플러그인 호출이 결과를 반환하지 않았습니다.
pt: A chamada do plugin não retornou resultado.
ru: Вызов плагина не вернул результат.
tr: Eklenti çağrısı bir sonuç döndürmedi.
zh_hant: 外掛調用未返回結果。

# plugin.error.loader.identifierMismatchFormat
source: 插件 ID 不匹配，manifest 为 %@，运行时代码为 %@。
ar: معرف البرنامج المساعد غير متطابق. البيان: %@، رمز وقت التشغيل: %@.
de: Plugin-ID stimmt nicht überein. Manifest: %@, Laufzeitcode: %@.
en: Plugin ID mismatch. Manifest: %@, runtime code: %@.
es: El ID del complemento no coincide. Manifiesto: %@, código de ejecución: %@.
fr: Incompatibilité d’ID de plugin. Manifeste : %@, code d'exécution : %@.
ja: プラグイン ID が一致しません。マニフェスト: %@、ランタイム コード: %@。
ko: 플러그인 ID가 일치하지 않습니다. 매니페스트: %@, 런타임 코드: %@.
pt: Incompatibilidade de ID do plug-in. Manifesto: %@, código de tempo de execução: %@.
ru: Несоответствие идентификатора плагина. Манифест: %@, код времени выполнения: %@.
tr: Eklenti kimliği eşleşmiyor. Manifest: %@, çalışma zamanı kodu: %@.
zh_hant: 外掛 ID 不匹配，manifest 為 %@，運行時代碼為 %@。

# plugin.error.loader.invalidPluginCountFormat
source: 插件包 %@ 必须返回 1 个插件，实际返回 %d 个。
ar: يجب أن تعرض حزمة البرنامج المساعد %@ مكونًا إضافيًا واحدًا بالضبط. لقد أعادت %d.
de: Plugin-Paket %@ muss genau 1 Plugin zurückgeben. Es wurde %d zurückgegeben.
en: Plugin package %@ must return exactly 1 plugin. It returned %d.
es: El paquete de complementos %@ debe devolver exactamente 1 complemento. Devolvió %d.
fr: Le package de plugin %@ doit renvoyer exactement 1 plugin. Il a renvoyé %d.
ja: プラグイン パッケージ %@ は 1 つのプラグインを返す必要があります。 %d が返されました。
ko: 플러그인 패키지 %@은 정확히 1개의 플러그인을 반환해야 합니다. %d을(를) 반환했습니다.
pt: O pacote de plugins %@ deve retornar exatamente 1 plugin. Ele retornou %d.
ru: Пакет плагинов %@ должен возвращать ровно 1 плагин. Он вернул %d.
tr: %@ eklenti paketi tam olarak 1 eklenti döndürmelidir; %d döndürdü.
zh_hant: 外掛包 %@ 必須返回 1 個外掛，實際返回 %d 個。

# plugin.error.loader.loadFailedFormat
source: 插件代码加载失败：%@
ar: فشل تحميل رمز البرنامج المساعد: %@
de: Plugin-Code konnte nicht geladen werden: %@
en: Plugin code failed to load: %@
es: Error al cargar el código del complemento: %@
fr: Le code du plugin n'a pas pu être chargé : %@
ja: プラグイン コードのロードに失敗しました: %@
ko: 플러그인 코드를 로드하지 못했습니다: %@
pt: Falha ao carregar o código do plug-in: %@
ru: Не удалось загрузить код плагина: %@
tr: Eklenti kodu yüklenemedi: %@
zh_hant: 外掛代碼加載失敗：%@

# plugin.error.loader.missingFactoryFormat
source: 插件缺少入口工厂：%@
ar: يفتقد البرنامج المساعد مصنع الإدخال الخاص به: %@
de: Plugin fehlt seine Eintrags-Factory: %@
en: Plugin is missing its entry factory: %@
es: Al complemento le falta su entrada de fábrica: %@
fr: Le plugin n'a pas sa fabrique d'entrée : %@
ja: プラグインにエントリ ファクトリがありません: %@
ko: 플러그인에 항목 팩토리가 없습니다: %@
pt: O plugin não possui sua fábrica de entrada: %@
ru: У плагина отсутствует фабрика ввода: %@
tr: Eklentide giriş fabrikası eksik: %@
zh_hant: 外掛缺少入口工廠：%@

# plugin.error.loader.unreadableBundleFormat
source: 无法读取插件 bundle：%@
ar: تعذرت قراءة حزمة البرنامج المساعد: %@
de: Plugin-Bundle konnte nicht gelesen werden: %@
en: Could not read plugin bundle: %@
es: No se pudo leer el paquete de complementos: %@
fr: Impossible de lire le bundle de plugins : %@
ja: プラグイン バンドルを読み取れませんでした: %@
ko: 플러그인 번들을 읽을 수 없습니다: %@
pt: Não foi possível ler o pacote de plug-ins: %@
ru: Не удалось прочитать пакет плагина: %@
tr: Eklenti paketi okunamadı: %@
zh_hant: 無法讀取外掛 bundle：%@

# plugin.error.dynamic.extractionCoordinatorRequiredFormat
source: 插件包变更需要由功能迁移协调器完成：%@
ar: يجب أن ينفذ منسق ترحيل الميزات تغيير حزمة المكون الإضافي: %@
de: Die Änderung des Plugin-Pakets muss vom Koordinator für die Funktionsmigration ausgeführt werden: %@
en: Plugin package change must be performed by the feature-migration coordinator: %@
es: El coordinador de migración de funciones debe realizar el cambio del paquete del complemento: %@
fr: La modification du paquet du plugin doit être effectuée par le coordinateur de migration des fonctionnalités : %@
ja: プラグイン パッケージの変更は機能移行コーディネータで行う必要があります: %@
ko: 플러그인 패키지 변경은 기능 마이그레이션 코디네이터가 수행해야 합니다: %@
pt: A alteração do pacote do plug-in deve ser realizada pelo coordenador de migração de recursos: %@
ru: Изменение пакета плагина должен выполнить координатор миграции функций: %@
tr: Eklenti paketi değişikliği, özellik geçişi koordinatörü tarafından yapılmalıdır: %@
zh_hant: 外掛套件變更需要由功能遷移協調器完成：%@

# plugin.error.dynamic.extractionDestinationBelowMinimum
source: 提取功能的目标插件版本过低。
ar: إصدار المكون الإضافي الوجهة لترحيل الميزة قديم جدًا.
de: Die Version des Ziel-Plugins für die Funktionsmigration ist zu alt.
en: The destination plugin version for feature migration is too old.
es: La versión del complemento de destino para la migración de funciones es demasiado antigua.
fr: La version du plugin de destination pour la migration des fonctionnalités est trop ancienne.
ja: 機能移行先のプラグインのバージョンが古すぎます。
ko: 기능 마이그레이션 대상 플러그인 버전이 너무 낮습니다.
pt: A versão do plug-in de destino para a migração de recursos é muito antiga.
ru: Версия целевого плагина для миграции функции устарела.
tr: Özellik geçişi için hedef eklenti sürümü çok eski.
zh_hant: 功能遷移的目標外掛版本過舊。

# plugin.error.dynamic.extractionDestinationNotReady
source: 提取功能的目标插件尚未就绪。
ar: المكون الإضافي الوجهة لترحيل الميزة غير جاهز.
de: Das Ziel-Plugin für die Funktionsmigration ist noch nicht bereit.
en: The destination plugin for feature migration is not ready.
es: El complemento de destino para la migración de funciones no está listo.
fr: Le plugin de destination pour la migration des fonctionnalités n’est pas prêt.
ja: 機能移行先のプラグインの準備ができていません。
ko: 기능 마이그레이션 대상 플러그인이 준비되지 않았습니다.
pt: O plug-in de destino para a migração de recursos não está pronto.
ru: Целевой плагин для миграции функции не готов.
tr: Özellik geçişi için hedef eklenti hazır değil.
zh_hant: 功能遷移的目標外掛尚未就緒。

# plugin.error.dynamic.recordNotFoundFormat
source: 未找到已安装的插件记录：%@
ar: لم يتم العثور على سجل المكون الإضافي المثبت: %@
de: Datensatz des installierten Plugins nicht gefunden: %@
en: Installed plugin record not found: %@
es: No se encontró el registro del complemento instalado: %@
fr: Enregistrement du plugin installé introuvable : %@
ja: インストール済みプラグインのレコードが見つかりません: %@
ko: 설치된 플러그인 기록을 찾을 수 없습니다: %@
pt: Registro do plug-in instalado não encontrado: %@
ru: Запись установленного плагина не найдена: %@
tr: Yüklü eklenti kaydı bulunamadı: %@
zh_hant: 找不到已安裝的外掛記錄：%@

# plugin.error.dynamic.rollbackRequiresUnloadedFormat
source: 无法回滚正在使用的插件包：%@
ar: لا يمكن التراجع عن حزمة مكون إضافي قيد الاستخدام: %@
de: Ein verwendetes Plugin-Paket kann nicht zurückgesetzt werden: %@
en: Cannot roll back a plugin package that is in use: %@
es: No se puede revertir un paquete de complemento que está en uso: %@
fr: Impossible de restaurer un paquet de plugin en cours d’utilisation : %@
ja: 使用中のプラグイン パッケージはロールバックできません: %@
ko: 사용 중인 플러그인 패키지는 롤백할 수 없습니다: %@
pt: Não é possível reverter um pacote de plug-in em uso: %@
ru: Нельзя откатить используемый пакет плагина: %@
tr: Kullanımda olan eklenti paketi geri alınamaz: %@
zh_hant: 無法回復正在使用的外掛套件：%@

# plugin.error.dynamic.runtimeValidationFailedFormat
source: 插件 %@ 运行验证失败：%@
ar: فشل التحقق من تشغيل المكون الإضافي %@: %@
de: Laufzeitprüfung für Plugin %@ fehlgeschlagen: %@
en: Runtime validation failed for plugin %@: %@
es: Error de validación en ejecución del complemento %@: %@
fr: Échec de la validation à l’exécution du plugin %@ : %@
ja: プラグイン %@ の実行時検証に失敗しました: %@
ko: 플러그인 %@ 런타임 검증 실패: %@
pt: Falha na validação em tempo de execução do plug-in %@: %@
ru: Сбой проверки плагина %@ во время выполнения: %@
tr: %@ eklentisi için çalışma zamanı doğrulaması başarısız oldu: %@
zh_hant: 外掛 %@ 執行驗證失敗：%@
